app/controllers/school_classes_controller.rb

    def find_school_class
        @school_class = SchoolClass.find_by(id: params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]